/*
 * 		반복문 :
 * 			for => 목록 , 크롤링 ... 페이징
 * 					=> 반복횟수가 지정
 * 				------------------------
 * 			while => 데이터베이스 연동
 * 					---------
 * 					반복횟수가 없는 경우에 주로 사용 : 무한루프
 * 			검색 / 로그인 / 회원 관련 => if / if~else
 * 			메뉴 / 버튼 ==> 다중 조건문 / switch
 * 			------------ 웹 => 화면 이동 <a href="">
 * 			1) 일차 for, 일차 while
 * 			   ------------------
 * 			   취업 준비 : 이차 for => 정보처리 , 코딩 테스트
 * 
 * 			while :
 * 				초기값	---------1
 * 					    |false 종료
 * 				while(조건식)  ----2--
 * 				{		| true      |
 * 					반복문장-------3  |
 * 					증감식--------4 --
 * 				}	
 * 		
 * 			순차적으로 동작 : 
 * 
 * 
 */
public class 정리_6 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
